# Pandas SQL : Window Function

N-Tile 

Percent_Rank

In [1]:
import numpy as np
import pandas as pd
import pandasql as ps

### Data

In [2]:
eid  = [x+1 for x in range(15)]
name = ["nurur","tom","peter","bo","binbin","jack","sid","don","rahman","nick",
        "adam","ross","kyle","sohel","robin"]
manager = ["xxxx","nurur","nurur","peter","peter","don","don","nurur","yyyy",
           "ross","ross","ross","zzz","kyle","carole"]
dept = ["ANALYTICS","ANALYTICS","ANALYTICS","ANALYTICS","ANALYTICS","IT","IT",
        "IT","IT","SALE","SALE","SALE","HR","HR","MARKETING"]
salary = [41000,29000,33000,21000,21000,33000,29000,24000,26500,51000,51000,43000,19000,13700,39000]

df = pd.DataFrame({"EmpID": eid, "EmpName":name, "EmpManager":manager, "EmpDept":dept, "EmpSalary":salary})

In [3]:
# df_id  = pd.DataFrame(data=[x+1 for x in range(15)], columns=['EmpID'] )
# df_name= pd.DataFrame(data=["nurur","tom","peter","bo","binbin",
#                             "jack","sid","don","rahman",
#                             "nick","adam","ross",
#                             "kyle","sohel",
#                             "robin"], columns=['EmpName'])
# df_manager = pd.DataFrame(data=["xxxx","nurur","nurur","peter","peter",
#                                 "don","don","nurur","yyyy",
#                                 "ross","ross","ross",
#                                 "zzz","kyle",
#                                 "carole"], columns=['EmpManager'])

In [4]:
# df_dept = pd.DataFrame(data=["ANALYTICS","ANALYTICS","ANALYTICS","ANALYTICS","ANALYTICS",
#                              "IT","IT","IT","IT","SALE","SALE","SALE","HR",
#                              "HR","MARKETING"], columns=['EmpDept'])
# df_salary = pd.DataFrame(data=[41000,29000,33000,21000,21000,
#                              33000,29000,24000,26500,
#                              51000,51000,43000,19000,13700,
#                              39000], columns=['EmpSalary'])
#
# df = pd.concat([df_id,df_name,df_manager,df_dept,df_salary], axis=1)

In [5]:
print( df.sort_values('EmpSalary', ascending=False).head(2) )

    EmpID EmpName EmpManager EmpDept  EmpSalary
9      10    nick       ross    SALE      51000
10     11    adam       ross    SALE      51000

In [6]:
a = ps.sqldf("""SELECT * FROM df ORDER BY EmpSalary DESC LIMIT 2""")
print(a)

   EmpID EmpName EmpManager EmpDept  EmpSalary
0     10    nick       ross    SALE      51000
1     11    adam       ross    SALE      51000

### Example : N-Tile

Single Partition of the Entire Dataset

In [7]:
"""Quartile"""
q = """
    SELECT *, 
    ntile(4) OVER (ORDER BY EmpSalary DESC) as Bucket 
    FROM df
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary  Bucket
0      10    nick       ross       SALE      51000       1
1      11    adam       ross       SALE      51000       1
2      12    ross       ross       SALE      43000       1
3       1   nurur       xxxx  ANALYTICS      41000       1
4      15   robin     carole  MARKETING      39000       2
5       3   peter      nurur  ANALYTICS      33000       2
6       6    jack        don         IT      33000       2
7       2     tom      nurur  ANALYTICS      29000       2
8       7     sid        don         IT      29000       3
9       9  rahman       yyyy         IT      26500       3
10      8     don      nurur         IT      24000       3
11      4      bo      peter  ANALYTICS      21000       3
12      5  binbin      peter  ANALYTICS      21000       4
13     13    kyle        zzz         HR      19000       4
14     14   sohel       kyle         HR      13700       4

Multiple Partitions of the Dataset

In [8]:
"""Quartile"""
q = """
    SELECT *, 
    ntile(4) OVER (PARTITION BY EmpDept ORDER BY EmpSalary DESC) as Bucket 
    FROM df
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary  Bucket
0       1   nurur       xxxx  ANALYTICS      41000       1
1       3   peter      nurur  ANALYTICS      33000       1
2       2     tom      nurur  ANALYTICS      29000       2
3       4      bo      peter  ANALYTICS      21000       3
4       5  binbin      peter  ANALYTICS      21000       4
5      13    kyle        zzz         HR      19000       1
6      14   sohel       kyle         HR      13700       2
7       6    jack        don         IT      33000       1
8       7     sid        don         IT      29000       2
9       9  rahman       yyyy         IT      26500       3
10      8     don      nurur         IT      24000       4
11     15   robin     carole  MARKETING      39000       1
12     10    nick       ross       SALE      51000       1
13     11    adam       ross       SALE      51000       2
14     12    ross       ross       SALE      43000       3

Decile

In [9]:
"""Decile"""
q = """
    SELECT *, 
    ntile(10) OVER (PARTITION BY EmpDept ORDER BY EmpSalary) as Bucket 
    FROM df
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary  Bucket
0       4      bo      peter  ANALYTICS      21000       1
1       5  binbin      peter  ANALYTICS      21000       2
2       2     tom      nurur  ANALYTICS      29000       3
3       3   peter      nurur  ANALYTICS      33000       4
4       1   nurur       xxxx  ANALYTICS      41000       5
5      14   sohel       kyle         HR      13700       1
6      13    kyle        zzz         HR      19000       2
7       8     don      nurur         IT      24000       1
8       9  rahman       yyyy         IT      26500       2
9       7     sid        don         IT      29000       3
10      6    jack        don         IT      33000       4
11     15   robin     carole  MARKETING      39000       1
12     12    ross       ross       SALE      43000       1
13     10    nick       ross       SALE      51000       2
14     11    adam       ross       SALE      51000       3

Percentile

In [10]:
"""Percentile"""
q = """
    SELECT *, 
    ntile(100) OVER (PARTITION BY EmpDept ORDER BY EmpSalary) as Bucket 
    FROM df
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary  Bucket
0       4      bo      peter  ANALYTICS      21000       1
1       5  binbin      peter  ANALYTICS      21000       2
2       2     tom      nurur  ANALYTICS      29000       3
3       3   peter      nurur  ANALYTICS      33000       4
4       1   nurur       xxxx  ANALYTICS      41000       5
5      14   sohel       kyle         HR      13700       1
6      13    kyle        zzz         HR      19000       2
7       8     don      nurur         IT      24000       1
8       9  rahman       yyyy         IT      26500       2
9       7     sid        don         IT      29000       3
10      6    jack        don         IT      33000       4
11     15   robin     carole  MARKETING      39000       1
12     12    ross       ross       SALE      43000       1
13     10    nick       ross       SALE      51000       2
14     11    adam       ross       SALE      51000       3

In [11]:
q = """
    SELECT * FROM
    (SELECT *, 
    ntile(4) OVER (PARTITION BY EmpDept ORDER BY EmpSalary DESC) as Bucket 
    FROM df) AS f
    WHERE Bucket=2
    """
a = ps.sqldf(q)
print(a)

   EmpID EmpName EmpManager    EmpDept  EmpSalary  Bucket
0      2     tom      nurur  ANALYTICS      29000       2
1     14   sohel       kyle         HR      13700       2
2      7     sid        don         IT      29000       2
3     11    adam       ross       SALE      51000       2

### Example : Percent_Rank

In [12]:
q = """
    SELECT * FROM 
    (SELECT *, 
    printf('%0.2f', percent_rank() OVER (ORDER BY EmpSalary)) as PercentRank
    FROM df) as f 
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary PercentRank
0      14   sohel       kyle         HR      13700        0.00
1      13    kyle        zzz         HR      19000        0.07
2       4      bo      peter  ANALYTICS      21000        0.14
3       5  binbin      peter  ANALYTICS      21000        0.14
4       8     don      nurur         IT      24000        0.29
5       9  rahman       yyyy         IT      26500        0.36
6       2     tom      nurur  ANALYTICS      29000        0.43
7       7     sid        don         IT      29000        0.43
8       3   peter      nurur  ANALYTICS      33000        0.57
9       6    jack        don         IT      33000        0.57
10     15   robin     carole  MARKETING      39000        0.71
11      1   nurur       xxxx  ANALYTICS      41000        0.79
12     12    ross       ross       SALE      43000        0.86
13     10    nick       ross       SALE      51000        0.93
14     11    adam       ross       SALE      51000        0.93

In [13]:
q = """
    SELECT * FROM 
    (SELECT *, 
    printf('%0.2f', percent_rank() OVER (PARTITION BY EmpDept ORDER BY EmpSalary)) as PercentRank
    FROM df) as f 
    """
a = ps.sqldf(q)
print(a)

    EmpID EmpName EmpManager    EmpDept  EmpSalary PercentRank
0       4      bo      peter  ANALYTICS      21000        0.00
1       5  binbin      peter  ANALYTICS      21000        0.00
2       2     tom      nurur  ANALYTICS      29000        0.50
3       3   peter      nurur  ANALYTICS      33000        0.75
4       1   nurur       xxxx  ANALYTICS      41000        1.00
5      14   sohel       kyle         HR      13700        0.00
6      13    kyle        zzz         HR      19000        1.00
7       8     don      nurur         IT      24000        0.00
8       9  rahman       yyyy         IT      26500        0.33
9       7     sid        don         IT      29000        0.67
10      6    jack        don         IT      33000        1.00
11     15   robin     carole  MARKETING      39000        0.00
12     12    ross       ross       SALE      43000        0.00
13     10    nick       ross       SALE      51000        0.50
14     11    adam       ross       SALE      51000        0.50